БухЭксп/Documents/CW_КорректировкаРегистров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>CW_КорректировкаРегистров</Name>
			<Posting>Deny</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.CW_ПеревыставлениеПоСтавкам</xr:Item>
				<xr:Item>AccumulationRegister.CW_РаботаВодителей</xr:Item>
				<xr:Item>AccumulationRegister.CW_ЗаправкиПодотчетныхЛиц</xr:Item>
				<xr:Item>AccumulationRegister.CW_РасходыПоГрузоперевозкамТранспортныхСредств</xr:Item>
				<xr:Item>AccumulationRegister.CW_КурсовыеРазницы</xr:Item>
				<xr:Item>InformationRegister.CW_СостоянияТС</xr:Item>
				<xr:Item>AccountingRegister.CW_МСФО</xr:Item>
				<xr:Item>AccumulationRegister.CW_ОперативнаяКредиторскаяЗадолженность</xr:Item>
				<xr:Item>AccumulationRegister.CW_ТопливоТС</xr:Item>
				<xr:Item>AccumulationRegister.CW_ДенежныеСредства</xr:Item>
				<xr:Item>InformationRegister.CW_УслугиПоДоговоруГрузоперевозки</xr:Item>
				<xr:Item>AccumulationRegister.CW_ПробегШин</xr:Item>
				<xr:Item>AccumulationRegister.CW_НезавершенноеПроизводство</xr:Item>
				<xr:Item>AccumulationRegister.CW_ОперативнаяДебиторскаяЗадолженность</xr:Item>
				<xr:Item>AccumulationRegister.CW_ОплатаИсходящихСчетов</xr:Item>
				<xr:Item>AccumulationRegister.CW_ЗаправкиТопливнымиКартами</xr:Item>
				<xr:Item>AccumulationRegister.CW_ОплатаВходящихСчетов</xr:Item>
				<xr:Item>InformationRegister.CW_ПараметрыТС</xr:Item>
				<xr:Item>InformationRegister.CW_СоответствиеАктовВходящимСчетам</xr:Item>
				<xr:Item>AccumulationRegister.CW_Перевыставление</xr:Item>
				<xr:Item>AccumulationRegister.CW_РасходГСМТС</xr:Item>
				<xr:Item>AccumulationRegister.CW_ВознаграждениеПоГрузоперевозкам</xr:Item>
				<xr:Item>InformationRegister.CW_ПрайсыКонтрагентов</xr:Item>
				<xr:Item>InformationRegister.CW_ШиныТС</xr:Item>
				<xr:Item>AccumulationRegister.CW_ОплатыПокупателейУСН</xr:Item>
				<xr:Item>InformationRegister.CW_ОплатаВходящихДокументов</xr:Item>
				<xr:Item>AccumulationRegister.CW_АктированиеИсходящихСчетов</xr:Item>
				<xr:Item>AccumulationRegister.CW_ПробегТС</xr:Item>
				<xr:Item>AccumulationRegister.CW_АктированиеВходящихСчетов</xr:Item>
				<xr:Item>AccumulationRegister.CW_ДоходыПоГрузоперевозкам</xr:Item>
				<xr:Item>AccumulationRegister.CW_РасходыПоПриобретениям</xr:Item>
				<xr:Item>InformationRegister.CW_ПоказанияОдометровТранспортныхСредств</xr:Item>
				<xr:Item>AccumulationRegister.CW_ЗарплатаВодителейТС</xr:Item>
				<xr:Item>InformationRegister.CW_РаспределениеОплатПокупателейУСН</xr:Item>
				<xr:Item>InformationRegister.CW_ДТГрузоперевозок</xr:Item>
				<xr:Item>InformationRegister.CW_СоответствиеАктовИсходящимСчетам</xr:Item>
				<xr:Item>AccumulationRegister.CW_РасходыПоГрузоперевозкам</xr:Item>
				<xr:Item>InformationRegister.CW_ОплатаИсходящихДокументов</xr:Item>
				<xr:Item>AccumulationRegister.CW_РасходыНаРеализацию</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособЗаполнения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СторнируемыйДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CW_РасходыПодотчетногоЛица</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_КорректировкаОперативнойЗадолженности</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_ДокументРасчетовСКонтрагентом</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_УстановкаПараметровТС</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_РасходыПоПриобретениям</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_УслугиПоДоговоруГрузоперевозки</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_ДвижениеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_ДоходыПоГрузоперевозке</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_КорректировкаРаспределенияОплатДляУСН</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_ШиномонтажТС</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_РаспределениеЗатратПутевыхЛистовПоГрузоперевозкам</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_РасходыПоГрузоперевозке</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_КорректировкаАктированияСчетов</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_РеестрПлатежей</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_РучнаяОперация</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_ПоступлениеТС</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_Оплата</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_ПрайсКонтрагента</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_ЗакрытиеГрузоперевозки</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_ПутевойЛист</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_DT_ТранспортноеСообщениеИсходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_КорректировкаПеревыставления</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_РеализацияПрочихТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_DT_ТранспортноеСообщениеВходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_ПроектыДТ</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_СписаниеЗатратНаРеализацию</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_ОтчетЭкспедитора</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_ВыбытиеТС</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_ВводОстатковНезавершенногоПроизводства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроизвольнаяДатаДвижений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаОперации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТаблицаРегистровСведений</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТаблицаРегистровНакопления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЗаполнениеДвижений</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

БухЭксп/Documents/CW_КорректировкаРегистров/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры

Процедура ЗаполнениеТаблицДокументаПриОбновлении() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КорректировкаРегистров.Ссылка
		|ИЗ
		|	Документ.CW_КорректировкаРегистров КАК КорректировкаРегистров
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.CW_КорректировкаРегистров.ТаблицаРегистровНакопления КАК КорректировкаРегистровТаблицаРегистровНакопления
		|		ПО (КорректировкаРегистровТаблицаРегистровНакопления.Ссылка = КорректировкаРегистров.Ссылка)
		|			И (КорректировкаРегистровТаблицаРегистровНакопления.НомерСтроки = 1)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.CW_КорректировкаРегистров.ТаблицаРегистровСведений КАК КорректировкаРегистровТаблицаРегистровСведений
		|		ПО (КорректировкаРегистровТаблицаРегистровСведений.Ссылка = КорректировкаРегистров.Ссылка)
		|			И (КорректировкаРегистровТаблицаРегистровСведений.НомерСтроки = 1)
		|ГДЕ
		|	КорректировкаРегистровТаблицаРегистровНакопления.Ссылка ЕСТЬ NULL 
		|	И КорректировкаРегистровТаблицаРегистровСведений.Ссылка ЕСТЬ NULL 
		|	И КорректировкаРегистров.ПометкаУдаления = ЛОЖЬ";

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();
    МетаданныеДокумента = Метаданные.Документы.КорректировкаРегистров;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ДокОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		НужноЗаписывать = Ложь;
		Для Каждого МетаданныеРегистра Из МетаданныеДокумента.Движения Цикл

			//Регистр     = Регистры.Добавить();
			РегистрИмя = МетаданныеРегистра.Имя;
			ПолноеИмя   = МетаданныеРегистра.ПолноеИмя();

			ПозицияТочки = Найти(ПолноеИмя, ".");
			ТипРегистра  = Лев(ПолноеИмя, ПозицияТочки - 1);

			ТипРегистра = ТипРегистра;

			ДокОбъект.Движения[РегистрИмя].Прочитать();
			Если ДокОбъект.Движения[РегистрИмя].Количество()> 0 Тогда
				Если ТипРегистра = "РегистрНакопления" Тогда
					НовСтр = ДокОбъект.ТаблицаРегистровНакопления.Добавить();
					НовСтр.Имя = РегистрИмя;
					НужноЗаписывать = Истина;
				ИначеЕсли ТипРегистра = "РегистрСведений" Тогда
					НовСтр = ДокОбъект.ТаблицаРегистровСведений.Добавить();
				    НовСтр.Имя = РегистрИмя;
					НужноЗаписывать = Истина;
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
				
		Если НужноЗаписывать Тогда
			
			ДокОбъект.ОбменДанными.Загрузка = Истина;
			ДокОбъект.ДополнительныеСвойства.Вставить("ОтключитьМеханизмРегистрацииОбъектов");
			ДокОбъект.ОбменДанными.Получатели.АвтоЗаполнение = Ложь;
		
			ДокОбъект.Записать();

		КонецЕсли;
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
